app/Controllers/Home.php

    public function f_listar_productos($id=null){
        $categoria = new CategoriaModel();
        $data['categorias'] = $categoria->findAll();

        $producto=new ProductoModel();
        $data['producto']=$producto->findAll();
---
SELECT *
FROM `productos`