app/Controllers/ProductoController.php

SELECT *
FROM `productos`
---
  public function f_listar_productos($id=null){
    $categoria = new CategoriaModel();
    $data['categorias'] = $categoria->findAll();

    $producto=new ProductoModel();
    $data['producto']=$producto->findAll();