app/Models/usuario_Model.php

SELECT *
FROM `usuarios`
JOIN `perfiles` ON `perfiles`.`id_perfiles` = `usuarios`.`perfil_id`
---
    public function getUsuarioAll(){
		$db = \Config\Database::connect();
		$builder = $db->table('usuarios');
		$builder->select('*');
		$builder->join('perfiles', 'perfiles.id_perfiles = usuarios.perfil_id');
		$query = $builder->get();